app/views/blogs/index.html.slim

      .card-action
        - if blog.user.image.present? || blog.user.name.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]