app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"  ORDER BY "blogs"."created_at" DESC
---
  def index
    @blogs = Blog.order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  ORDER BY "comments"."created_at" DESC  [["blog_id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 7]]
---
  def show
    @blogger_logged_in = current_user == @blog.user
    @comment = Comment.new(blog_id: @blog.id)
    @blog_comments = @blog.comments.order(created_at: :asc)
    @blog_current_user_like = @blog.likes.for_user(current_user).first

INSERT INTO "blogs" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user = current_user

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["image_file_name", "road_big.jpg"], ["image_file_size", 232489], ["image_updated_at", "2017-07-30 14:47:33.856203"], ["updated_at", "2017-07-30 14:47:33.943731"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)