app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "blog_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Test!"], ["blog_id", 7], ["user_id", 1], ["created_at", "2017-06-12 16:00:30.598774"], ["updated_at", "2017-06-12 16:00:30.598774"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save